{
    "name": "Echo Look | Hands-Free Camera and Style Assistant with Alexa-includes Style Check to get a second opinion on your outfit",
    "url": "http://www.amazon.com/dp/product-reviews/B0186JAEWK",
    "price": "$119.99",
    "count": 128,
    "ratings": {
        "5 star": "37%",
        "4 star": "12%",
        "3 star": "14%",
        "2 star": "14%",
        "1 star": "23%"
    },
    "reviews": [
        {
            "review_text": "Easy to set up. Easy to use. Photos are sharp. You must first download the app (to set up). Once you do, you can just say \"Alexa, take a photo\" and it will take the photo (with flash). You will get a notification on your phone and you can see the photo immediately. At that point, you can delete it, or take another. Once you take your photo, you have the option to make some small edits (saturation, etc). However, you cannot crop your photo. *AMAZON - THIS IS MY BIGGEST GRIPE: I want to be able to crop my photo and take my clutter out!* (I cropped my crap out of the photo I provided - to show quality). You can also take two photos and get an opinion as to which is better, as well as suggestions for similar looks. Options to make notes on the outfit​. The front page of the app also has (of course) links to shop clothing, as well as relevant articles (ex: sponsored by Vogue). You can delete individual photos. I also use this to take progress photos for fitness, and I delete those REAL QUICK - they don't get uploaded to Amazon Heaven. Once you take the photo, you have the option to delete or share (several apps, including google drive). I have no idea where they really go, because I don't see them in my phone gallery *AMAZON GENIE - MY SECOND WISH: that I can save to my phone & full transparency on where these things actually 'go' This device also can take video. And play music though doesn't have the (annoying) bass of the large echo. I have another Echo elsewhere in the home. One can play different music on each device without any additional membership (I have prime only, not prime music). How does it compare to mirror selfies: (1) you don't need a mirror, you can see yourself in the phone). (2) Somehow I look better (pre edit) in photos taken by the Look than in my phone photos - they're very saturated and sharp with the device. (3) you can take the photo without the risk of selfie stick shadow, and without the annoying flash of your camera (and phone itself) in the photo. I paid for this device, but was able to order it early. I also have 1984 paranoia, so I turn it to face the wall when I'm not using it.",
            "review_posted_date": "29 Jun 2018",
            "review_header": "very sharp photos. also plays music.",
            "review_rating": "4.0 ",
            "review_author": "Luck3"
        },
        {
            "review_text": "don't waste your money just yet. The camera is great but the app is so bad, you almost can't use the device. Read the app reviews in the App Store before you purchase. It will just save you the trouble of making he return. If amazon listens to the consumer maybe they will improve the app and it will get better. Right now I will have to return everything because it just doesn't work properly yet. So sad too. I was so looking forward to organizing all my clothing and shoes into different collections. But this would take me years to do since the app crashes nonstop. And apparently this was happening to everyone. I didn't read the reviews prior to purchasing. Shame on you amazon! it's not like you don't have the resources to make a decent product.",
            "review_posted_date": "03 Jul 2018",
            "review_header": "app crashes and makes camera unusable",
            "review_rating": "1.0 ",
            "review_author": "XG"
        },
        {
            "review_text": "The echo look manages to be a mediocre alexa, and a useless fashion app. The echo functionality is no better than its cheaper dot cousin. The camera and app are about as useful as a selfie stick.The fashion guidance is poor, and seems to be all based on color and not on fit or style. Would not recommend (even with the newer software updates). Spend the money on a show, or another echo member.",
            "review_posted_date": "20 Jun 2018",
            "review_header": "a mediocre alexa, and a useless fashion app in one",
            "review_rating": "1.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "I'll update this once I've used it more, but so far I enjoy it. When I first set it up I had it so it took photos looking in the direction of my bed because that was the only option. It was horrible. I hated all my photos, I hated my body, I was like whelp no this isn't happening. So, she went back in the box. Cue about four days later, I opened it up and tried it again by pointing it in the direction of my white closet doors. It made SUCH a huge difference. My photos come out a lot crisper. One thing I would definitely note is that if you're tall, you're going to have to work with it a little to find the right angle. I'm 6'1 and when they said to put it at shoulder height they were SO wrong. It made me look dumpy. Try a different angle if you absolutely hate it at first. I can't comment on long-term usability yet but another suggestion, if you do not have a plain backdrop, is to hang up a sheet per a suggestion from a friend. That works super well too. Overall, I'm satisfied. Would I pay $200 for it? Absolutely not. Would I wait for Prime Day or Black Friday or whatever comes up next that drops it to $100? Yes. Totally not worth paying full price for it, because at the end of the day, it's a glorified Alexa with a freakishly good camera. I can do the same thing with a closet app on my phone and take mirror selfies. I'd say that's one difference with the Alexa though, you can see your backside, which can be helpful when you're comparing prints or shapes of skirts. The one time I used the \"compare outfits\" option already knowing which one looked styled better, she got it right, so I'm happy with that.",
            "review_posted_date": "20 Jul 2018",
            "review_header": "Make sure you have the right back drop!",
            "review_rating": "4.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "I have not owned my Look for a year yet, and it doesn't get used more than once daily (not even every day), yet I am starting to feel as if the video feature is about to fail. I have had a few instances in which I have asked it to take a video, and it has turned on, then off right away, without taking any video. I am also less than impressed with the style experts, as I often completely disagree with their preferences. My friends and work colleagues cannot understand their preferences either, and almost always prefer the 'other' outfit to the one those experts have chosen.",
            "review_posted_date": "04 Jul 2018",
            "review_header": "Feels like the video function could be failing",
            "review_rating": "3.0 ",
            "review_author": "Janet G."
        },
        {
            "review_text": "Prons: - Very good at taking selfies - nice design Cons: - not valuable at main feature: giving style advice Maybe it will learn to be better but in the current state not that good. Let me put it this way. When you are buying a high-end product with some huge AWS AI neural network behind it you expect it to be something more than a selfie-taker! I want conversations like: --- - Alexa, how am I looking? - I think that black skirt you were wearing last Sunday would match this top better --- or --- - Alexa, am I underdressed for a friends wedding? - I think high heels would suit better than flip-flops for this occasion. --- or --- - Alexa, do you think I need to buy more jeans? - You were wearing blue jeans that you bought in September just once. Are you sure you need another pair? --- So I want it to have some sort of intelligence, not just randomly assigned percentage score for each look.",
            "review_posted_date": "28 Aug 2018",
            "review_header": "style check needs improvements",
            "review_rating": "3.0 ",
            "review_author": "Alexander"
        },
        {
            "review_text": "I like everything!!!! My daughter got this for me for Christmas,best gift ever!!!! I take a picture everyday before I go to work.I loce to compare outfits to see which one works best.my best friend and I are getting ready for a trip so I send her pictures of what I'm bringing,and now she wants an Echo Look so we can send pictures of our fashion back and forth.",
            "review_posted_date": "07 Jun 2018",
            "review_header": "This makes fashion so much fun!!!!",
            "review_rating": "5.0 ",
            "review_author": "Debbie Randolph"
        },
        {
            "review_text": "​It is very fashionable, simple to use, and it even the most confident stylist can benefit from another's opinion.",
            "review_posted_date": "10 Jun 2018",
            "review_header": "Why not get a stylist's opinion?",
            "review_rating": "5.0 ",
            "review_author": "Private Citizen"
        },
        {
            "review_text": "The Echo look is an interesting idea...I do like that it will compare outfits and pick the better one for me. I also like that it does other Alexa/Echo things, like play music from your Prime Music, give weather reports, etc. I haven't used it as much as I first thought I would, but because of its other capabilities, it will definitely be something I keep and continue to find uses for as time goes on. I think the only thing I don't love is that the camera feature doesn't filter out the background quite as much as I thought it would, and sometimes when it does, it does so at a bit of a strange angle. Otherwise, I like it.",
            "review_posted_date": "10 Jun 2018",
            "review_header": "The Echo look is an interesting idea...",
            "review_rating": "4.0 ",
            "review_author": "Christine J. Jannes"
        },
        {
            "review_text": "You would have to describe me as an Alexa devotee, advocate and total addict. I am responsible for the purchase of up to 90% of Alexa devices owned in my state. I use them for assistants, home automation, secretaries, intercoms. Thus, it pains me greatly to give this one the dong. The assistant AI is non-functional. That’s ok. I wasn’t expecting much. The killer was its complete inability to be redeployed into my otherwise totally harmonious Amazon driven existence. It doesn’t work as a security camera which was the only other use I could think of for it. You can’t drop in on it, make calls from it. Nada. I know its failings are due to security features but this is a total waste. Don’t bother.",
            "review_posted_date": "23 Aug 2018",
            "review_header": "My first Alexa reject.",
            "review_rating": "1.0 ",
            "review_author": "Astute Shopper"
        },
        {
            "review_text": "You would have to describe me as an Alexa devotee, advocate and total addict. I am responsible for the purchase of up to 90% of Alexa devices owned in my state. I use them for assistants, home automation, secretaries, intercoms. Thus, it pains me greatly to give this one the dong. The assistant AI is non-functional. That’s ok. I wasn’t expecting much. The killer was its complete inability to be redeployed into my otherwise totally harmonious Amazon driven existence. It doesn’t work as a security camera which was the only other use I could think of for it. You can’t drop in on it, make calls from it. Nada. I know its failings are due to security features but this is a total waste. Don’t bother.",
            "review_posted_date": "23 Aug 2018",
            "review_header": "My first Alexa reject.",
            "review_rating": "1.0 ",
            "review_author": "Astute Shopper"
        },
        {
            "review_text": "The Echo Look is an Artificial Intelligence device, AI, that can help you do many things in your life. It has almost all of the current features that are available in the Amazon Echo but it also has a 5 MP digital camera that you can control using your voice. Rather than holding your smart phone for taking selfies, you can ask the Echo Look to take a full length photo of yourself and take photos from many angles while you pose. You can capture and store the photos of all of your outfits in the Amazon Cloud so you can compare them and have the Echo Look tell you which outfit looks the best on you using style check. Style check is an AI software that uses input from fashion specialist to judge how your different outfits compare to today’s most popular styles. You can also use the photos to send to your favorite social network and have a full length photos rather than just a close up selfie. The camera can take high quality photos and videos. The camera has its own built in lighting and a depth sensing camera. The photos add in a digital blurring called Brokeh effect. It means that the subject of the photo, you, stands out and the background is blurred as not to distract from your crystal clear photo. This shallow depth of field makes a perfect portrait photo of professional quality. You are the “star model” while using this camera and you can take as many poses as you wish using the Echo Look. We found the photos to be of good quality and the blurring of the background works very well. I have not posted any photos or videos with this review as Amazon has done a good job supporting this product with their own videos. You should take the time to watch them. My attached video goes over the product and what I liked and I didn’t like. We already use three Amazon Echoes in our home, one on each floor, and we like the features that Alexa can do for us. The Echo Look can do these same features that we use daily: • Set daily alarms like get up times or time to take your medicine, or pick up your child at school. • Set one time occurring alarms like time to leave for movies. • Set timers for deadlines like cooking alerts or to get the clothes out of the dryer. • Find a local restaurant. • Get the time of the day or the date. • Check the scores of the NFL games. • Check the weekly game schedule of your favorite team. • Play your favorite music style, my wife likes 70’s rock. • Find your local weather or ask if it will rain today. • Turn lights off and on in your home. • Control various items in your home like sprinklers, appliances, lights, etc… • Tell you the latest news. • Read your Kindle books to you and she does quite well doing this. Not only can she play your audio books but she can also read your digital Kindle books using text to speech technology. This is one of my favorite features when my eyes get tired from reading. • Check the traffic. • Check your calendar. • Look up recipes for food or mixed drinks. • Tell you a joke. • Help to do your Amazon shopping. • The opportunities are endless…. Amazon Echo Look can do all of this and more. It is a virtual digital personal assistant. You can also view the photos using the Echo View app that is available for your Apple IOS 9 or higher or Android phone or tablet using Lollipop or above operating systems. Alexa responds to voice commands to take photos or 6 seconds of a video. Alexia will continue to learn things as you use her. She will even continuously learn from the fashion specialist to help you select the best outfits to wear. The Look has a 1.6 watt speaker and a microphone array to listen to your verbal commands. There is a microphone array and camera off button so you can be assured of your privacy. Four LEDs are used to provide lighting for photos and they are bright. The camera is 5 MP with depth-sensing technology. The unit has an Intel Atom CPU. Please see my attached video. Your photos and videos are stored in the cloud and Amazon provides 3 years of free unlimited cloud storage. The Echo Look also has a 1 year warranty. What’s in the box? • The Echo Look which is smaller than I expected. It is about 5 ¼ inches tall. It weighs in at 5.4 ounces. It has two camera thread bosses in the unit and one is on the bottom and the other is located on the back. That allows for easy wall mounting or simply standing the unit up on a shelf. You can adjust the tilt angle using the mounting base. On the side is a microphone and camera off and on button. In the back is a speaker output and the plug for the power input. On the top is the four microphone array. On the front is the camera and the 4 lighting LEDS. For great photos, make sure the camera lens is free of dust and smudges. • Mounting base that has a tilt-able camera thread stud. It also has a rubber ring to prevent slipping. • Power adapter rated at 100 to 240 VAC and 50/60 Hertz the output is 15VDC at 1.4 Amps and it is UL listed. The power cable is almost 8 feet long from the AC wall plug to the tip of the power plug for the Amazon Echo Look. • Mounting wall kit consisting of the wall plate, 2 screws and 2 anchors • Quick start guide • It is important to note that the base of the Echo Look has a standard camera sized tripod socket. Normally you set the Look close to the edges of a table or counter so as your photo does not include the table top in the photo. You need to stand about 5 feet away and center yourself and say, “Alexa take a photo.” You can just as easily take a short 6 second video. You want the lens about shoulder height. You can tilt the Look as needed but make sure that it is stable to prevent it from falling. When setting up the unit it wants to connect to the same WIFI as the smart device that you are using the Echo Look app on. First install the downloadable apps onto. Your smart phone or tablet, plug in the Amazon Look device and turn on the app. All you have to do is follow the instructions. Since you are using the same WIFI as your smart device the Look already knows the WIFI password because of that. That makes it simple, fast and easy to set up. To have the Echo Look read one of your Kindle books you will have to use the Amazon Alexa App and you will find that the Echo Look device is listed as an acceptable device for setup in that app. Just follow the steps to read your Kindle book just like you would using your Amazon Echo. If you have any questions just post a comment. Cons: 1. No manual volume control, only voice controlled. 2. The unit has a small speaker and the audio quality is OK for its size but it is not great nor is it nearly as good as the standard Amazon Echo speaker system. 3. I like the small size and it is nice to set in the edge of a shelf or chest of drawers. By having such a small size the volume level and the timber of the audio is not as good as the original Echo. 4. The unit has a single button to disable the camera and the microphone. There should have been two buttons. If you press the button, the microphone is turned off and now you cannot use Alexa for any of the features like play music that need a voice command. Having two buttons would have allowed you to turn off the camera but leave the microphone on. 5. If you press the button to turn off the mic and the camera, a red light comes on dimly around the camera and a small bright red LED comes on to indicate that the camera and the mic mute button are off. Having two LEDS on the front is not good in my opinion. If you turn the Echo Look camera/mic off then you will see these two lights in your dark bedroom at night. I find these LED lights to bother me when I’m trying to go to sleep as they light up the room in some manner. Since we normally dress in our bedroom this would be the most common place for us to located the Echo Look. Overall this is a nice product and the next generation of Amazon intelligent devices. It is part of the move to higher technology and I rated it at 4 stars. I think it will be a hit for the younger generation that are trying to be stylish every day in the way they dress for school, work or just for a night out. Anyone that works in a professional office would also find the camera useful to help them select the right outfits to wear to work. If you have any question please write me a comment. I also hope the attached video was helpful in some way to help you make a decision on the product.",
            "review_posted_date": "07 Sep 2018",
            "review_header": "The next generation of intelligent Alexa devices!",
            "review_rating": "4.0 ",
            "review_author": "JJCEO"
        },
        {
            "review_text": "I love my Echo Look! It makes it so much easier to take photos and videos of my outfits. No more fumbling with a phone camera, or asking someone to take my photo! It always understands my commands and takes quality photos. I wish I could tell it to not use the flash and I do wish the video quality was better. I’m sure the app will get better over time as well. I wish there was social media integration to make sharing everything easier too. I haven’t used it to rate my outfits as I don’t use that feature. Also the items it suggests to compliment my outfits are totally out of whack with what I wear. If you’ll look at my photo you’ll see I love kawaii clothes, but the suggestions are always like, a black loose fitting tank top. Other than that it’s awesome!",
            "review_posted_date": "22 Jun 2018",
            "review_header": "Pretty Cool!",
            "review_rating": "4.0 ",
            "review_author": "Laura Landolf"
        },
        {
            "review_text": "I LOVE this product. I present myself as a performer ,so at my age, I have to appear to be at my best. The Echo can easily be used for adding pictures to your computer to email to any contacts you want, to see you as you currently appear Since this picture was taken I have lost 10 lbs. in two weeks. Keeping motivated is important. Thank you ECHO LOOK. Cherrine Murphy 8-22-18",
            "review_posted_date": "22 Aug 2018",
            "review_header": "Love the high quality camera.",
            "review_rating": "5.0 ",
            "review_author": "cherrine murphy"
        },
        {
            "review_text": "Dear Amazon, We like your stuff and we love technology. We have over a half dozen devices, and two prime accounts going in our family of 5. Multiple Echos, a Tap, and the husband unit even has one of those Echos with the screen. As a designer & maker, and someone who does not purchase a lot of RTW, the Echo Look could be useful. I like technology to help humans be better. The Echo Look really could help with more responsible consumption and fewer bad fast-fashion purchases (which means fewer returns.) Also, for those of us really involved in #mmmay - there are quite a few people out there who have a hard time keeping up the whole month, and this could be the answer. Hopefully this is fixed by 2019 for #mmmay19 Ok. That was the good part and to counter the really lame trolls on here. Be part of the solution. Seriously. I’ve had the Echo Look for 2 weeks now. Went into the store 4 days ago, hoping an employee could answer questions. Employees had never even seen one, and pointed me to the phone number for customer service. Today I called customer service. First I talked to TK, who tried to tell me that Amazon wasn’t available at this time (um, I’m in the same time-zone). That was funny, and not in a good way. TK told me that they only trouble shoot problems and that they can’t forward my call to the design team (which I did not ask for, I asked for someone on his team that knew about app/device updates and about using the Echo Look.) TK forwarded me to “George” - I will note that George started out with an American Southern accent which he quickly lost as he went back to his native language accent. I”m not sure what the point of that was....? I think after he realized I wasn’t Grandma complaining about not being able to get ther Fire stick to work, he dropped the fake southern accent. George actually tried to first talk me into returning the device. You might want to look into that. George didn’t know anything either, and eventually told me to write a review here. The Catch-22 is amazing. The store knows nothing and points consumers to the phone people. The phone people are irritable, they do not like that I’m asking device & app update questions, they don’t know anything, and point consumers to return the product or write a review here. Ok, now to my problems and requests for solutions. 1. Pre, what, 2000, I was that person that got red-eye when not even looking at the camera. Technology and cameras have advanced so that isn’t an issue...or I pull out the DSLR and use an external flash - but even then, my DSLR is new enough it doesn’t really have those issues. The Echo Look’s 4 LEDs are SO bright, I look like a Replicant from Blade Runner. No exaggeration. It’s like you went back in time with technology. Not even looking at the camera, I still get retina refraction like crazy. I tried putting scotch tape over the LEDs to soften the impact which reduces the Replicant look by 50% but then the app doesn’t like that and tells me something is wrong and till not apply any of the filters or the blurry vignette feature (Pop.) You have to fix this. I’m NOT alone. Going through Instagram for EchoLook photos is like Replicant Tinder. You’ve got to do a hardware OS update and fix that, and/or allow the app to reduce flash brightness. 2. Let’s talk about Pop or the weird blurry vignette slider that isn’t really a slider. Yes, it is helpful, but please update app so that slider is really a slider. Right now it is A. Nothing. B. You’re floating in a blurry cloud C. You’re actually swimming in amniotic fluid. 3. The fashion compare options. HAHAHA. Oh. Please. The algorithm is set to 1950. Seriously, try it. Put on, say, nice linen overalls with a wide leg, paired with a mid-volume silk shirt - totally on trend, and put it next to an outfit that looks like it was bought from Chicos (think princess seamed button up shirt in novelty print, and a defined waist-pant, and it picks the Chicos outfit every time. Fit & Flare isn’t the only design aesthetic, thanks. Please update app to have style preferences. Think Stitch Fix or the Nordstrom version of Stitch Fix...it’s for men, so my husband uses it, not me, but they’re VERY good. You’re in the same town as Blake, just go over and ask him how they set up the Nordstrom version of Stitch Fix, ‘kay?? 4. You may need a more diverse group working on this product. I’ll let you figure out that one, but I’ll give you a hint. If you gear something towards women, with ONLY women in ALL of the product demos, then maybe there should be more women, particularly women in fashion/design, involved in the process. Also...you may want to diversify your product demos... lovely range of women with POCs...all the same size and age range. And just women. Call me, I’ll help you. 5. I shouldn’t have to pull this all into PhotoShop. This should be plug-in-play directly to Instagram. You’re losing SO much with all of these issues. Your Echo Look account isn’t even used - I’ve got a stinking suspicion you’re already planning on dropping this product. I can’t find ANY reviews other than the PR release you GAVE out. I seriously don’t care what 40+ year old hetero white men not in fashion/design have to say about this product, nor what they forced their single female staffer to do with it. There’s NOTHING. Which tells me there’s suppression, and possibly such a great loss already you’re looking to bag out completely and are ready to erase it. I’d prefer you supported it instead. It wasn’t a bad idea. I prefer it to having to set up my DSLR or propping my iPhone on my tripod...but my iPhone takes way better photos and has a portrait option that rivals my DSLR. That and no replicant. /novella",
            "review_posted_date": "19 Jul 2018",
            "review_header": "Actual User Review - not a troll and not an affiliate",
            "review_rating": "3.0 ",
            "review_author": "Becky Jo"
        },
        {
            "review_text": "I bought it for my wife to use with her sewing business and the results were spectacular, especially during this past prom season. Clients being able to see themselves was a hit.",
            "review_posted_date": "08 Jun 2018",
            "review_header": "I bought it for my wife to use with her ...",
            "review_rating": "5.0 ",
            "review_author": "Joe Log"
        },
        {
            "review_text": "I purchased this for the sole purpose of being able to take higher quality photos for my ebay listings when no one is home to help me. Overall it has boosted my sales, and the Amazon fashion credit $25 I purchased a cute pink Nine West watch with! In the downtime you can ask Alexa to play music - the speaker system isnt the best like the traditional Alexa, but this is a pretty wonderful product for the money. I do like that you can document photos of the back of your head- and yes my colorist is not doing the best job I have learned, you can also photo the moles on your back and document that for health records. I'm not using it for the \"styling\" purposes its sold for- but I think its a pretty darn good product for the money- my only wish would be they improve the speaker quality for music.",
            "review_posted_date": "11 Sep 2018",
            "review_header": "VERY HAPPY/ USE THIS FOR EBAY PHOTO TAKING / Plays MUSIC",
            "review_rating": "5.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "This I a great product. Taking photos is easy. It does all of the other functions as the other ECHO devices. It would be nice to perhaps have a viewing screen in a future verison. In the app i would like to have the photos to be able to auto save to my photo album in my cloud or on my phone. I am using this device to chronical my outfits. If you are into fashion i would highly suggest. Another use is to take a group photo.",
            "review_posted_date": "07 Jun 2018",
            "review_header": "Great Device",
            "review_rating": "5.0 ",
            "review_author": "Shaun S. Chester"
        },
        {
            "review_text": "This device has done something unexpected. I didn’t use to pay attention to what I wear and ended up repeating the same clothes over and over that looked tired and boring. Got this device on a whim just to try out how it works. After 3-4 days of taking my pictures with the device I realized I was repeating the same colors, wearing similar clothes. Its different from looking yourself in the mirror everyday because your brain forgets (and ignores). But the Echo Look phone app captures your looks over days and shows you trends, which is a real eye-opener. I decided to clean up my closet, it motivated me to go donate so many old clothes that were tired now and didn’t even look good on me. I pulled out clothes I had bought but were hidden somewhere in the closet, experimented with a few combinations and realized I actually have some good clothes that I wasn’t wearing! Just looking at yourself from a third person perspective helped me discover what looks good on me. I imagine looking back at my pictures several years from now and seeing how I’ve aged and changed my looks over time. Some people say that I can just take a selfie or use my phone. I thought so too, but no that doesn’t work for two reasons 1) selfies don’t capture a full-length view and who’s gonna plug the phone in and out of a selfie stick every morning, no way! 2) the convenice of just asking Alexa to take a picture is unbeatable. It reduces the friction in the process which is needed if you want to be consistent and capture your looks regularly so you can review and find patterns. Thank you Amazon for being so innovative! When I first heard of the device I thought its a joke, but I now realize how cool and useful it is!",
            "review_posted_date": "28 Jul 2018",
            "review_header": "Game changer",
            "review_rating": "5.0 ",
            "review_author": "Sunny"
        },
        {
            "review_text": "I purchased this hads free camera & app during the Prime Tuesday for a great price.I don't know how I lived without it.I take a picture if every oufit I put on.I keep the picture if I like the outfit or not so I can go back to it on my phone & see which outfits work & which don't.Sometimes I stare at my clost filled with all my clothes & still feel like I just don't know what outfit can be pulled together.With this whole system I just scroll through my pictures & I find outfits there.It's a wonderful tool to have & I highly recommend any lady who is into fashion as I am to get this. . .",
            "review_posted_date": "23 Aug 2018",
            "review_header": "My clothes can't live without this device",
            "review_rating": "5.0 ",
            "review_author": "Rena End"
        },
        {
            "review_text": "I absolutely love Echo Look. The pictures it takes are beautiful and fun to share. It is very easy to say \"Alexa take a photo\", and if you don't like it, it's easy to keep saying \"Alexa, take a photo\" until you get just the perfect shot. It's fast...no hassling with resetting your phone/pad etc...No tripod or selfie stick needed, and the 360 feature is great...this is especially great for those who sell clothing online. It makes the photo process so much easier and focuses on the outfit vs. the room or background. The style check and comparative features/ ratings are great additions if you want feedback or opinions with explanations.",
            "review_posted_date": "07 Jun 2018",
            "review_header": "Easy to use Alexa commands, GREAT photos, saves time and effort for clothing sellers, and sharing/style check/opinion features",
            "review_rating": "5.0 ",
            "review_author": "Teresa Vella"
        },
        {
            "review_text": "The Echo Look is an interesting device however, it lacks the power of most other Echo devices. It also gets confused when there is another Echo device within hearing distance. The other Echo devices figure out which is the closest to the speaker, however, the Echo Look acts like it cannot. The images and video are great, however, it would be nice to get them automatically outside of the Echo Look mobile app. The Echo Look also has limited skill capabilities and doesn't seem to be up to par with other Echo devices with Alexa capabilities. It is a good second (or third) Echo device, however it is not a good showcase for what Alexa can do.",
            "review_posted_date": "06 Jun 2018",
            "review_header": "Are you talking to me? Are you talking to me?",
            "review_rating": "3.0 ",
            "review_author": "G. Humphrey"
        },
        {
            "review_text": "This is the worst Echo of all. I bought it during the testing stage based on its description. What a big mistake! It's almost useless. You can not DROP IN from the new Amazon Echo Spot (which is the best Amazon Echo in my view!) either! Instead of buying this product, buy Amazon Echo Spot!",
            "review_posted_date": "11 Aug 2018",
            "review_header": "Worst Echo product ever! I wish that I can return this!",
            "review_rating": "1.0 ",
            "review_author": "eDude"
        },
        {
            "review_text": "I grew up with two sisters and when we dress up we always double check with each other to ensure that we chose the right belt color, the right top to match and even the best matching shoes. I now live alone and in a different time zone. Here comes the Echo Look. I am not saying that it replaced my sisters' opinions but it is doing a banging job trying to be on their level. At time I am unsure about an outfit and the Echo Look has been helpful in coming up with the best/most perfect choice. The Echo Look has the function of all the other Echo device, however it does not sound as good. I would not recommend playing music with it, the music sounds as if it is coming off of one of those old disc (the one before cassette tapes). It does answers to other questions just as the other echo, I just do not personally the sound system in the Echo Look when it comes to answers to those command. Since it was not designed for that purpose, I can say that the bad sound system does not bother me much and will not deduct any stars. It got even better when Amazon fix the commands so that when I ask regular questions, my other echos answer instead of the Echo look. Final Thoughts: I highly recommend this if you're not good at pairing your outfits, if you own too many outfits and need a way to keep track, and/or just for the heck of it. It is not an expensive selfie camera as some have asked, it does a really great job at being a great personal stylist. I highly recommend this product.",
            "review_posted_date": "02 Oct 2018",
            "review_header": "Personal Stylist in your home",
            "review_rating": "5.0 ",
            "review_author": "Rose-Hermance Rony"
        },
        {
            "review_text": "It's fun to take photos of one's wardrobe, especially when one has just lost 65 pounds, is looking pretty good in nice clothes again and is buying lots of new clothes as sizes drop. I wish there were a way to save the photos to Prime photos or Yahoo etc as I haven't been able to get them to my PC to back up or use. I wasn't familiar with designer names so wasn't chosen for any focus groups when the email was sent, but have since found I have a lot of those designer clothes in my closet from shopping at Marshall's and Ross. At 67, I'm not really the target market for this item, but have enjoyed the pictures as weight continues to drop. The speaker on this is really poor, and as it's set up in my living room, it often hears when I try to play music on my kitchen Echo and plays instead of the main Echo, so now I keep the microphone on the Echo Look turned off except for taking photos. I wish it had at least two choices as to the focal distance. I wear a lot of wigs and would like to take my wig-review photos with Look, as well as photos of makeup and nails, but the camera is strictly for full-body shots. The main purpose of this item appears to be selling expensive high-end clothing, and it now sends advertisements for such in the app. It could be useful for so much more than it currently is with just a second distance setting and a way to share photos to Prime etc.",
            "review_posted_date": "18 Jun 2018",
            "review_header": "Seems to be designed to sell expensive high-end clothing",
            "review_rating": "3.0 ",
            "review_author": "KAT Moser"
        },
        {
            "review_text": "I love my Echo Look. I can keep track of outfits I like, remember what I wore on a certain date, compare styles to see which looks best, and much more!!",
            "review_posted_date": "09 Jun 2018",
            "review_header": "I love my Echo Look",
            "review_rating": "5.0 ",
            "review_author": "Lori S"
        },
        {
            "review_text": "I absolutely love this device and I wish they had something similar to this years ago. It takes extremely well pictures and they are great quality. It has a very easy set up, the only thing I had to do was get the app and synchronize it with my phone. All I have to say is\" Alexa take a photo\" and all the photos I have taken stores in my phone on the app. It is so easy and convenient to use I would highly recommend!",
            "review_posted_date": "11 Sep 2018",
            "review_header": "It is certainly worth the price",
            "review_rating": "5.0 ",
            "review_author": "Tabitha CM"
        },
        {
            "review_text": "I like that it works as another regular echo product and that I can change the user using only my voice, but I expected it to be more useful, like sending the picture of the day and receiving a review of it, not just comparing 2 outfits.",
            "review_posted_date": "09 Jun 2018",
            "review_header": "I like that it works as another regular echo product and ...",
            "review_rating": "3.0 ",
            "review_author": "JulioL85"
        },
        {
            "review_text": "Great Amazon product!. I’m so glad I brought this wonderful gift to my wife, because now she doesn’t have to ask me for a second opinion when she get dressed. It was so hard for me to tell her that I didn’t like what she was wearing because there was always an argument. I’m really happy with this purchase. Quick and easy setup, very nice photos and videos. My wife loves it. Highly recommended!!",
            "review_posted_date": "05 Sep 2018",
            "review_header": "Wonderful!",
            "review_rating": "5.0 ",
            "review_author": "Miguel E Acosta"
        },
        {
            "review_text": "I was an invited user... so I figured, I'd give it a shot despite the cost. Frankly, I'd have preferred another Echo Spot instead. It doesn't really do much other than store photos in the cloud. The idea that I'd get recommendations based on my style... didn't' quite happen. That would have been terrific. It's much harder to change settings than on a Spot. It also doesn't always let me go from one room to the next in continued listening as my Spot does. I'd suggest anyone wanting to get an app for selfies pass on this.",
            "review_posted_date": "14 Sep 2018",
            "review_header": "Not much more than an app",
            "review_rating": "3.0 ",
            "review_author": "Cathe B"
        },
        {
            "review_text": "I’m a blogger and I purchased this for its video capabilities. Unfortunately, the video feature is only for seconds. It would be totally worth the cost if the videos could be longer (like 5 minutes.)",
            "review_posted_date": "07 Sep 2018",
            "review_header": "Video Feature Disappointing",
            "review_rating": "1.0 ",
            "review_author": "Sharlyn Lauby"
        },
        {
            "review_text": "The biggest draw back is the fact that, when I take it to a client's house, I have to initiate the set up process every time I switch WiFi networks. This makes sense the first time I go somewhere, but to have to do it every time I return home is a pain in the neck. Due to that, I no longer take it to client's homes so it rarely gets used. :-( I've not used any of the outfit suggestion features, just the camera with the blurring background capabilities.",
            "review_posted_date": "10 Jun 2018",
            "review_header": "No capacity for more than one WiFi network",
            "review_rating": "4.0 ",
            "review_author": "rock_girl"
        },
        {
            "review_text": "Where do I begin I got this to help organize my wardrobe it has become so much more it helps me realize what I should be wearing, creates collection and gives me fashion advice. I really love the collections feature so that I can separate my wardrobe based on color, weather or anything i choose.",
            "review_posted_date": "12 Aug 2018",
            "review_header": "A girls personal stylist",
            "review_rating": "5.0 ",
            "review_author": "Trisha Zulic"
        },
        {
            "review_text": "This is by far the best Echo device that I own. I like how it helps me to keep track of my wardrobe and my best outfits. While I'm not sure that I can justify the $200 price tag, and waiting five months just to be accepted to buy this (I don't think that the waiting for invites to buy it is still a thing...) I can say that I think that this is a great device.",
            "review_posted_date": "14 Jul 2018",
            "review_header": "Great device, but price is too high to love it.",
            "review_rating": "4.0 ",
            "review_author": "Ethan"
        },
        {
            "review_text": "I love the Echo Look. It does almost everything of a normal Alexa which I love. I get music and weather in my bedroom. Plus the camera shows a different view of your outfit than a mirror. It is also nice to almost have a digital closet in your phone of your favorite outfits.",
            "review_posted_date": "13 Jun 2018",
            "review_header": "Worth it",
            "review_rating": "5.0 ",
            "review_author": "Christine Otter"
        },
        {
            "review_text": "Just set it up and loving it so far. If you appreciate fashion you will love the Echo Look. Plus it was half off on Prime Day. To Jeff Bezos and fellow Amazon pioneers, keep up the good work.",
            "review_posted_date": "20 Jul 2018",
            "review_header": "Prime Day steal",
            "review_rating": "5.0 ",
            "review_author": "karen forte"
        },
        {
            "review_text": "I bought this instead of an alexa but the sound is awful. I also experienced a number of connection issues. I feel like this is really good if you NEED to take a photo of yourself everyday but for other every day uses this is not very productive.",
            "review_posted_date": "29 Jun 2018",
            "review_header": "not practical for everyday use",
            "review_rating": "1.0 ",
            "review_author": "Kelly Gentry"
        },
        {
            "review_text": "Waste of money. Can't save pictures to my phone. Useless",
            "review_posted_date": "03 Sep 2018",
            "review_header": "Waste of money",
            "review_rating": "1.0 ",
            "review_author": "Thedoc"
        },
        {
            "review_text": "Love everything about this. It does so much than expected. You can do a video to see the back of your outfit. YouCam also compare and they get back to you very quickly with the choice.",
            "review_posted_date": "09 Aug 2018",
            "review_header": "Amazing",
            "review_rating": "5.0 ",
            "review_author": "Tyiesha Thaxton"
        },
        {
            "review_text": "I love how easy to set up and use this product is. However, one of its most significant weaknesses is that it does not allow for battery operation and is therefore not suitable for outdoor shoots in beautiful natural settings, which is one of the key features I was looking for to show of some outfits on my blog. Too bad.",
            "review_posted_date": "07 Jun 2018",
            "review_header": "I love how easy to set up and use this product ...",
            "review_rating": "4.0 ",
            "review_author": "Brigitte Pauli"
        },
        {
            "review_text": "I like being able to see what the outfits look like in a photo, but I do think the camera add pounds.",
            "review_posted_date": "07 Jun 2018",
            "review_header": "I like being able to see what the outfits look like ...",
            "review_rating": "4.0 ",
            "review_author": "val"
        },
        {
            "review_text": "Admitedly, I bought this on trust. I thought this would do some sort of AI to check clothes. I was also thinking it would double as a security camera of some sort. It does neither. I consider this a total wasted of money. Do your research before making assumptions! Come take it for free from me !",
            "review_posted_date": "01 Oct 2018",
            "review_header": "Who wants this!?",
            "review_rating": "2.0 ",
            "review_author": "Tom A. Gore"
        },
        {
            "review_text": "Look is the red-headed step child of the Amazon Alexa device family. It has one cool feature --the camera -- but Amazon doesn't support it for any of the other new features they introduce. No Drop In, no broadcast announcements, and so on. I love the photo feature, but boy do you pay for it literally and figuratively",
            "review_posted_date": "07 Jun 2018",
            "review_header": "Crippled and abandoned by Amazon",
            "review_rating": "1.0 ",
            "review_author": "Gordon Meyer"
        },
        {
            "review_text": "Another product from Amazon that is really special. You need this!",
            "review_posted_date": "17 Jul 2018",
            "review_header": "Five Stars",
            "review_rating": "5.0 ",
            "review_author": "travelway2muc"
        },
        {
            "review_text": "The Look is a little slow and not that intuitive to use. I thought I would really enjoy using it but not so much. It is difficult to figure out where to stand to get a good picture.",
            "review_posted_date": "07 Jun 2018",
            "review_header": "I thought I would really enjoy using it but not so much",
            "review_rating": "3.0 ",
            "review_author": "scubasue"
        },
        {
            "review_text": "I had this echo for some time and it is not without it's charm. It's a gimmicky device but it does help you get an overall look at your wardrobe before heading out. I have used the assistant and submitted photos in order to get the algorithm's input on which outfit was best. It's pretty much subjective, I didn't see a rhyme or reason to the input from the echo look. The ability to see yourself before heading out it a nice bonus but it isn't anything that you can't get from a webcam at a cheaper price. Th quality of the video and pictures is nice.Overall it was easy to setup and it's a nice feature to give yourself a 360 degree look to your outfit before going but I can't justify the gimmicky features for the price tag.",
            "review_posted_date": "24 Jun 2018",
            "review_header": "Nice device but a little too gimmicky",
            "review_rating": "3.0 ",
            "review_author": "veritech_13"
        },
        {
            "review_text": "I installed a flat monitor vertically on our master bedroom wall to view the pictures that the echo look takes. This works perfect for choosing your look for the day.",
            "review_posted_date": "21 Jul 2018",
            "review_header": "The New Way to Dress",
            "review_rating": "5.0 ",
            "review_author": "Tommyboy"
        },
        {
            "review_text": "I love how easy it is to collect shots of outfits put together so you can look them up and reuse the combinations again.",
            "review_posted_date": "07 Jun 2018",
            "review_header": "Great for wardrobe accuracy!",
            "review_rating": "5.0 ",
            "review_author": "Neccos"
        },
        {
            "review_text": "Should come with Bluetooth connectivity to other speakers, but it does not. Major disappointment compared to other Echo devices.",
            "review_posted_date": "27 Jul 2018",
            "review_header": "Should come with Bluetooth connectivity to other speakers, but it does not. Major disappointment compared to other Echo devices.",
            "review_rating": "3.0 ",
            "review_author": "$.#.!.K.@"
        },
        {
            "review_text": "I love it much 😍 the future is here but please make the deep learning machine smarter !!! And Alexa smarter with choosing our clothes.",
            "review_posted_date": "09 Jun 2018",
            "review_header": "I love it much 😍 the future is here but please ...",
            "review_rating": "5.0 ",
            "review_author": "Hani"
        },
        {
            "review_text": "I really like this as an addition to my echo show, for a less used area of the house. It turns on lights, gives news updates and best of all takes pictures so I can get a full look of outfits. The only thing I don't like is the poor sounding speaker.",
            "review_posted_date": "08 Jun 2018",
            "review_header": "Does everything Alexa plus photos",
            "review_rating": "4.0 ",
            "review_author": "TenSgal"
        },
        {
            "review_text": "Until a recent update was release, it was difficult to start it up.",
            "review_posted_date": "08 Jun 2018",
            "review_header": "It is now worth it.",
            "review_rating": "3.0 ",
            "review_author": "Johnne M"
        },
        {
            "review_text": "This device does not support functionality of the other devices in the echo family. No drop in, no calling, etc. It would be nice if it could communicate with the other devices in the family.",
            "review_posted_date": "30 Jun 2018",
            "review_header": "It would be nice if it could communicate with the other devices in ...",
            "review_rating": "2.0 ",
            "review_author": "Alfonso L."
        },
        {
            "review_text": "The picture quality is great, I use more for full length selfies of me and my husband. My niece loves it too.",
            "review_posted_date": "09 Aug 2018",
            "review_header": "It’s perfect",
            "review_rating": "5.0 ",
            "review_author": "bon jovi"
        },
        {
            "review_text": "This is a great idea... in theory. However the app was so bad that I returned it.",
            "review_posted_date": "24 Aug 2018",
            "review_header": "Disappointing",
            "review_rating": "1.0 ",
            "review_author": "Hannah"
        },
        {
            "review_text": "I have a number of suggestions for how to make it better. the camera should be useful for more than just a single snap. the style comparisons should provide more details. Its pretty generic. I like that the alexa functionality is built into it, but I still have trouble making alexa do things like - start my day command and follow a script of several things im interested in. instead of having to say alexa whats the price of bitcoin and then alexa whats the weather like in bigfork montana and then alexa what does my calendar look like today ? anyway specifically for the look features - they have a long way to go before its really useful.",
            "review_posted_date": "06 Jun 2018",
            "review_header": "I think it has a long way to go before its useful.",
            "review_rating": "3.0 ",
            "review_author": "Henry Valentino"
        },
        {
            "review_text": "It was nice to have a collection of outfits I could pull up. The ability to save and send the photos was also very nice. I see it as more of a selfie posting device and would recommend a better quality camera, but it definitely works for what it is intended for.",
            "review_posted_date": "11 Jun 2018",
            "review_header": "It was nice to have a collection of outfits I could pull ...",
            "review_rating": "3.0 ",
            "review_author": "Troy Caldwell"
        },
        {
            "review_text": "I’m not sure I appreciate using this device for it’s purpose of upgrading my wardrobe... I wish it had different functionality such as a security camera function... but that... as I have discovered... is not it’s purpose at all. Please note that I own probably one of every Amazon device made so far. This is by far the one I use the least. You may use it more than I do but I think the other devices that have a screen might be able to do the same thing as this and have more functionality in general. I was an early purchaser of this device.",
            "review_posted_date": "06 Jun 2018",
            "review_header": "Can this thing do anything else?",
            "review_rating": "2.0 ",
            "review_author": "Michael A. Bukowski"
        },
        {
            "review_text": "While it is good ...in my opinion, it is not great...there are issues with the camera and it tends to go off line quickly....even with excellent wifi.",
            "review_posted_date": "06 Jun 2018",
            "review_header": "While it is good..",
            "review_rating": "3.0 ",
            "review_author": "Lawrence I. Stern"
        },
        {
            "review_text": "I love the ease of taking photos from any angle and videos. It really helps me to see how I look to others, not just the face in the mirror. The fashion tips and comparison of outfits is really helpful Super easy to set up and even easier to use!!",
            "review_posted_date": "09 Aug 2018",
            "review_header": "More than I expected",
            "review_rating": "5.0 ",
            "review_author": "B. Durrant"
        },
        {
            "review_text": "Pretty good device overall but it definitely could be made better with a lot of small features. One being a 360 swivel mount instead of the two current configurations. The current setup limits your mobility and planning of how you want to use it. Also that being said having a option to flip the camera so it can take pictures in a different orientation so that you can save space. The power cord would be nice if it were able to disconnect from the bulky box so that it could be fed through a wall easily compared to having to use a coat hanger or wire puller. The pictures are great on it but like I was saying the design could use some work.",
            "review_posted_date": "06 Jun 2018",
            "review_header": "Good concept. Only Fair Design",
            "review_rating": "3.0 ",
            "review_author": "Cameron Heimerdinger"
        },
        {
            "review_text": "I don't like it, I used it twice i am calling amazon to return. Useless to me because not storaging the pictures.",
            "review_posted_date": "23 Aug 2018",
            "review_header": "I don't like it, I used it twice i am calling ...",
            "review_rating": "2.0 ",
            "review_author": "Fatmata Sesay"
        },
        {
            "review_text": "Useless. Wish I just got a regular alexa instead. Totally not worth the money. Just collecting dust and facing the wall.",
            "review_posted_date": "06 Sep 2018",
            "review_header": "Useless",
            "review_rating": "2.0 ",
            "review_author": "Jennipug"
        },
        {
            "review_text": "My wife loves this device. Every morning she uses it. Very informative and useful.",
            "review_posted_date": "26 Jul 2018",
            "review_header": "Very informative and useful.",
            "review_rating": "5.0 ",
            "review_author": "HWR2"
        },
        {
            "review_text": "This was a given to me as a Christmas gift from my husband and I must say it is an amazing tool. It is like having your girlfriends there to help choose your look daily.",
            "review_posted_date": "13 Jun 2018",
            "review_header": "Awesome fashion tool",
            "review_rating": "5.0 ",
            "review_author": "RCol"
        },
        {
            "review_text": "The Echo Look is great for evaluating your look from all angles. The option where the Look does comparisons or offers suggestions is less valuable, as it takes a bit to load and is not always consistent.",
            "review_posted_date": "07 Jun 2018",
            "review_header": "Good option to check out your look",
            "review_rating": "4.0 ",
            "review_author": "Susan B. Sinnott"
        },
        {
            "review_text": "Great product. Used it a few times to compare outfits, otherwise used it for normal Alexa uses. Works great.",
            "review_posted_date": "21 Jun 2018",
            "review_header": "Very useful",
            "review_rating": "5.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "like the fact that it takes full length photos and the quality is great! however, I wish the video part lasted a little longer..",
            "review_posted_date": "07 Jun 2018",
            "review_header": "Great Photos",
            "review_rating": "3.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "Much better than taking pictures in a mirror using a cell phone! I love it.",
            "review_posted_date": "05 Aug 2018",
            "review_header": "5/5",
            "review_rating": "5.0 ",
            "review_author": "bjkm9789"
        },
        {
            "review_text": "Let me preface by saying I'm an Alexa addict. I have echo dots, the show, the original alexa, and an alexa fire TV. I love them all. The Echo Look, however, is the biggest disappointment I have ever purchased, and one of the few items I have actually returned. It was that bad. The camera quality is terrible, the speaker quality is terrible, you cannot use it for calling or messaging, and if you connected in via the app to use the video camera, the quality is on par with a 56k faxmodem. Abysmal product when compared to Amazon's other offerings. The only way I could see this being viable is if you are the kind of vain, talentless consumer who considers instagramming pictures of yourself a \"career\" or if you've ever used the term \"make-up tutorial\" without laughing. Otherwise, save your money and buy a mirror if you want to know what you look like every day.",
            "review_posted_date": "14 Sep 2018",
            "review_header": "Biggest Waste of Money Ever",
            "review_rating": "1.0 ",
            "review_author": "John"
        },
        {
            "review_text": "Just an expensive Alexa device. The \"styling\" advice was pretty useless",
            "review_posted_date": "16 Jul 2018",
            "review_header": "The \"styling\" advice was pretty",
            "review_rating": "2.0 ",
            "review_author": "M. Tremblay"
        },
        {
            "review_text": "I really don't understand why I can't tell this device to turn off the flash, it is really unpretty to take photo with flash during late afternoon. Trash.",
            "review_posted_date": "05 Sep 2018",
            "review_header": "Need to improve customer experience",
            "review_rating": "1.0 ",
            "review_author": "Zemeng Zhang"
        },
        {
            "review_text": "Prepping for a trip or day to day work outfits has never been easier!!!",
            "review_posted_date": "26 Jun 2018",
            "review_header": "Never take a outfit mirror selfie again",
            "review_rating": "5.0 ",
            "review_author": "Rachelle Markerson"
        },
        {
            "review_text": "Picture quality was very bad",
            "review_posted_date": "13 Jun 2018",
            "review_header": "One Star",
            "review_rating": "1.0 ",
            "review_author": "Arzoo"
        },
        {
            "review_text": "It’s not a bad tool in the least. The trouble is my expectation was that it would be in some sense a “mirror replacement”. But my expectations were likely misaligned. It feels weird to compare against designer opinions and the compare against my wardrobe results in 60/40 splits that don’t quite offer the firm opinion I would like to hear. But it’s not that the tool itself doesn’t work. I just think it would be better to integrate with an actual full length mirror that doubles as a screen for me to compare looks. That would be killer.",
            "review_posted_date": "06 Jun 2018",
            "review_header": "It’s not a bad tool in the least",
            "review_rating": "3.0 ",
            "review_author": "Patrick Kennedy"
        },
        {
            "review_text": "great camera! love this product!",
            "review_posted_date": "04 Jul 2018",
            "review_header": "Five Stars",
            "review_rating": "5.0 ",
            "review_author": "Striv001"
        },
        {
            "review_text": "Easy to use, works well with Alexa. Great buy!",
            "review_posted_date": "13 Aug 2018",
            "review_header": "Works like a charm",
            "review_rating": "5.0 ",
            "review_author": "Mr. Daniels"
        },
        {
            "review_text": "It’s not a bad tool in the least. The trouble is my expectation was that it would be in some sense a “mirror replacement”. But my expectations were likely misaligned. It feels weird to compare against designer opinions and the compare against my wardrobe results in 60/40 splits that don’t quite offer the firm opinion I would like to hear. But it’s not that the tool itself doesn’t work. I just think it would be better to integrate with an actual full length mirror that doubles as a screen for me to compare looks. That would be killer.",
            "review_posted_date": "06 Jun 2018",
            "review_header": "It’s not a bad tool in the least",
            "review_rating": "3.0 ",
            "review_author": "Patrick Kennedy"
        },
        {
            "review_text": "great camera! love this product!",
            "review_posted_date": "04 Jul 2018",
            "review_header": "Five Stars",
            "review_rating": "5.0 ",
            "review_author": "Striv001"
        },
        {
            "review_text": "Easy to use, works well with Alexa. Great buy!",
            "review_posted_date": "13 Aug 2018",
            "review_header": "Works like a charm",
            "review_rating": "5.0 ",
            "review_author": "Mr. Daniels"
        },
        {
            "review_text": "I am enjoying using my Echo Look to decide what clothes in my over filled closet I need to keep and which ones I need to get rid of. I can get a good front and rear view without asking my husband using the video option too!",
            "review_posted_date": "12 Jun 2018",
            "review_header": "Helping me declutter my closet!",
            "review_rating": "5.0 ",
            "review_author": "Kindle Customer Kat"
        },
        {
            "review_text": "Liked the product but wasn’t very useful",
            "review_posted_date": "08 Jun 2018",
            "review_header": "Four Stars",
            "review_rating": "4.0 ",
            "review_author": "Joe Black"
        },
        {
            "review_text": "Was hoping for more when I purchased this. The main feature element of the Look aside from any other Alexa hardware device is the ability to get “feedback” on your outfit. But this requires putting on a full outfit, snapping a picture, putting on a different outfit (or at least changing one thing), snapping another picture and getting a “recommendation” on which outfit combo is better. However, I’m not convinced that the “bots” behind this wouldn’t alter recommendations just based on angle, lighting, or some component has nothing to do with the outfit itself. In the end, you have to do a lot for a non-confidence inspiring response. All with an inferior speaker to serve as a replacement Alexa device in the bedroom. It’s just not worth it. Stick with the Echo/Dot.",
            "review_posted_date": "07 Jun 2018",
            "review_header": "Feature lite",
            "review_rating": "2.0 ",
            "review_author": "Chad S Lusk"
        },
        {
            "review_text": "My expectations were higher. The app definitely needs improvement. It crashes sometimes and can be really slow",
            "review_posted_date": "09 Aug 2018",
            "review_header": "Performance is not great",
            "review_rating": "2.0 ",
            "review_author": "Lauris"
        },
        {
            "review_text": "I purchased this on the pre-order and was quite excited about the new product. It worked great at first, and was lots of fun to use. But without notice the app just quit working. I can continue to take pictures but I never get feedback. It is so frustrating! So now I own an expensive camera that talks. I hope Amazon works out the bugs in their app.",
            "review_posted_date": "14 Jul 2018",
            "review_header": "Lots of Bugs in App",
            "review_rating": "2.0 ",
            "review_author": "Ladybug93021"
        },
        {
            "review_text": "We bought this with an expectation for it to work like the echo dot when not using the camera functions. It does \"okay\", but seems to lack features of the dot. If I had to do it again, I wouldn't have bought it. Doesn't have the practical use I thought it would.",
            "review_posted_date": "27 Jun 2018",
            "review_header": "Not really satisfied with the use of it.",
            "review_rating": "1.0 ",
            "review_author": "Darren"
        },
        {
            "review_text": "I have very mixed feelings about the Echo. Since seeing Clueless for the first time I’ve wanted a way to have a visual log of my outfits and get style tips on what to wear with what. The basic feature of taking a picture has been buggy. Sometimes it works perfectly, sometimes it doesn’t work at all and I’m stuck taking pictures in my full length mirror like usual. I’ve found the general Alexa tool is even worse. Most of the time it doesn’t acknowledge any other question or command other than “take a picture.” I’ve really thought about returning it because it’s so expensive, but I’m holding out hope that there’s an update that might fix my frustrations. I would advise waiting to purchase until the device improves.",
            "review_posted_date": "20 Jun 2018",
            "review_header": "Very buggy device, but I have hope",
            "review_rating": "2.0 ",
            "review_author": "Kathleen Watson"
        },
        {
            "review_text": "Useless. A lot of effort and very little upside, the recommendations are not personal or interesting. Also costs $8 to return!!",
            "review_posted_date": "03 Jul 2018",
            "review_header": "Lot of effort and little upside, and $8 to return!!",
            "review_rating": "1.0 ",
            "review_author": "JULIAN"
        },
        {
            "review_text": "Bought this for my wife to replace the echo dot in her changing room. The camera works great, but with such close proximity to the dot I couldn't have them both in the same room. Using this as the primary echo device in the room is really terrible. The speaker quality is absolute trash, so can't listen to music at all with it. For the cost of this thing it really needs to be able to be as good as a dot, with the added capability of the Look. Sending it back for now, but hoping they can improve the product and maybe in a few years I'll give it another shot for an anniversary present.",
            "review_posted_date": "24 Jul 2018",
            "review_header": "Good camera, subpar as an Echo",
            "review_rating": "3.0 ",
            "review_author": "Brian Connor"
        },
        {
            "review_text": "We bought this because we love Amazon's private labeled products. We thought this product can organize our closet and we tried. But it is very time consuming everytime we stand in front of the camera, take pictures and open the app to check the appearance. It is a great idea but it just not fit in our life style.",
            "review_posted_date": "22 Jun 2018",
            "review_header": "Good idea, but not fit in our life style",
            "review_rating": "3.0 ",
            "review_author": "365 Days of Happiness"
        },
        {
            "review_text": "Another awesome device from Amazon. Having the ability to simply say Amazon Look take a pic and have it learn from the picture taken is awesome. Pictures are depth photography so only the item in focus shows while blurring out the messy bedroom lol. Great for the fashion side as well as having the ability to have my wife being able to send pics to me as Amazon Look content is available from cloud so can access through Amazon Look app (using the iphone and ipad version)",
            "review_posted_date": "06 Jun 2018",
            "review_header": "Another great innovative Amazon product - Easy to use and can access content through cloud",
            "review_rating": "5.0 ",
            "review_author": "BorderBuyer_com"
        },
        {
            "review_text": "Does what it says. I'm hoping for more interesting applications in the future though. Haven't used it much bring the setup, but the camera itself is fine. Needs better integration with the rest of the echo ecosystem though. (Can't send or receive announcements, for instance.)",
            "review_posted_date": "12 Jun 2018",
            "review_header": "It's a fashion camera from Amazon.",
            "review_rating": "4.0 ",
            "review_author": "Charles Anderson"
        },
        {
            "review_text": "I bought it in hopes of Amazon expanding on it's functions as it has done w/ Alexa. This has not happened & since I waited it been too long for a return. All it really is : A very over-priced blue tooth camera.",
            "review_posted_date": "08 Jun 2018",
            "review_header": "Over-priced remote camera......",
            "review_rating": "2.0 ",
            "review_author": "Patriot"
        },
        {
            "review_text": "I was so excited about the look and in the end was very disappointed. It takes very unflattering photos and is hard to position to improve things. I wanted to have a great gallery of photos of what’s in my closet but in the end just felt like I body shamed myself too much because I could never get a flattering photo.",
            "review_posted_date": "07 Jun 2018",
            "review_header": "Wanted to love it, didn’t.",
            "review_rating": "1.0 ",
            "review_author": "Glowy Skin"
        },
        {
            "review_text": "Great tool for double checking outfit! Sometimes it’s hard to choose and complete outfits, particularly for special occasions. Not to mention you can play music and set a “time to leave” alarm while you get ready. :-)",
            "review_posted_date": "07 Jun 2018",
            "review_header": "Great tool for double checking outfit",
            "review_rating": "5.0 ",
            "review_author": "Reema M. Hamdan"
        },
        {
            "review_text": "Would be helpful to have the Echo Look app available on iPad. Along with this, the device should be able to pair to mobile hotspot (I am a college student and, like most universities, the school wifi is not compatible with Alexa products due to school safety concerns). Great quality photos. Audio is decent for commands but not meant for music/streaming.",
            "review_posted_date": "08 Jun 2018",
            "review_header": "Great product - Small Reccs",
            "review_rating": "4.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "It has never connected to the internet... Their technical staff pretty much couldn’t work.. So now I am stuck with a device that does. It work ☹️☹️☹️, as it is past return return date..",
            "review_posted_date": "29 Jun 2018",
            "review_header": "Don’t buy it",
            "review_rating": "1.0 ",
            "review_author": "Onuwa Uzor"
        },
        {
            "review_text": "I love it! It really helps one evaluate one's appearance.",
            "review_posted_date": "06 Jun 2018",
            "review_header": "My Look On Echo Look",
            "review_rating": "5.0 ",
            "review_author": "DareDave"
        },
        {
            "review_text": "I love the picture selfie and excited to explore the fashion looks in the future",
            "review_posted_date": "06 Jun 2018",
            "review_header": "Five Stars",
            "review_rating": "5.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "The functionality of the Echo Look is limited. Yes, you can ask Alexa a question but the sound quality is poor. Therefore, you would not able to play music and use the Echo Look to replace your other Echos. The look is only for taking pictures of yourself. Its an expensive selfie stick.",
            "review_posted_date": "09 Aug 2018",
            "review_header": "The echo look only takes pictures and not video.",
            "review_rating": "1.0 ",
            "review_author": "Monique Jackson"
        },
        {
            "review_text": "you have to have a giant space to get a full body shot. the software currently doesn't work any better than just using my phone hands free.",
            "review_posted_date": "08 Jun 2018",
            "review_header": "the software currently doesn't work any better than just using my phone hands free",
            "review_rating": "1.0 ",
            "review_author": "StrollingLifesPath"
        },
        {
            "review_text": "Fun and so easy to use! Can also use for pictures instead of selfies! I highly recommend!",
            "review_posted_date": "06 Jun 2018",
            "review_header": "Five Stars",
            "review_rating": "5.0 ",
            "review_author": "SherryG"
        },
        {
            "review_text": "Clearly geared for female gender. As a single male I still enjoy the picture taking ability.",
            "review_posted_date": "06 Jun 2018",
            "review_header": "Geared to females.",
            "review_rating": "4.0 ",
            "review_author": "rxdj"
        },
        {
            "review_text": "How can I count the numbers of disappointing features? In the beginning it was hard to set up, and I'm a webmaster, used to technology. Next, I was forced to find a way to hide my mobile phone when taking pictures. Oh, and let's not forget the time lag, trying to guess what the picture will be when you take it. What's the difference between a selfie in the mirror and Echo Look? Practically nothing. After some months passed of me just letting it sit there, I attempted to use it again. This time, it didn't want to sync with my new wireless router or my phone. When I called customer service for assistance, they essentially told me I was on my own. Not Echo Look's problem. If I could, believe me, I'd get my money back. Such trash tech. A rip off, big time.",
            "review_posted_date": "06 Jun 2018",
            "review_header": "How can I count the numbers of disappointing features?",
            "review_rating": "1.0 ",
            "review_author": "ReluctanTexan"
        },
        {
            "review_text": "I love the blurred background when you take a picture but it just looks off because of the way it makes you individually stand out. It just looks kinda strange",
            "review_posted_date": "07 Jun 2018",
            "review_header": "I love the blurred background when you take a picture but ...",
            "review_rating": "2.0 ",
            "review_author": "stacey"
        },
        {
            "review_text": "Never used camera. Not my favorite amazon product.",
            "review_posted_date": "07 Jun 2018",
            "review_header": "Not my favorite amazon product",
            "review_rating": "2.0 ",
            "review_author": "Mae"
        },
        {
            "review_text": "I love the echo look! My kids use it daily, i use it daily. Great for seeing what outfit combos you have and what is in your wardrobe. For the most part does all of the same stuff a regular echo does and more.",
            "review_posted_date": "06 Jun 2018",
            "review_header": "Great addition to the echo family!",
            "review_rating": "5.0 ",
            "review_author": "Radfordshorty"
        },
        {
            "review_text": "I have used it once or twice but would not recommend or order it.",
            "review_posted_date": "06 Jun 2018",
            "review_header": "... have used it once or twice but would not recommend or order it",
            "review_rating": "1.0 ",
            "review_author": "rich hammel"
        },
        {
            "review_text": "It wasn't what I expected",
            "review_posted_date": "07 Jun 2018",
            "review_header": "Two Stars",
            "review_rating": "2.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "Connection issues. Sporadically just starts talking in the middle of the night. Pictures are not great. For the price it should have all of the features the other Echo devise have.",
            "review_posted_date": "11 Jul 2018",
            "review_header": "Buy a different Echo device",
            "review_rating": "1.0 ",
            "review_author": "Ntheis"
        },
        {
            "review_text": "works well. keep it in my office as just another amazon device...but this one takes pics",
            "review_posted_date": "06 Jun 2018",
            "review_header": "Nice device",
            "review_rating": "4.0 ",
            "review_author": "Richard"
        },
        {
            "review_text": "What the heck is the use of this",
            "review_posted_date": "21 Aug 2018",
            "review_header": "Useless Item",
            "review_rating": "1.0 ",
            "review_author": "avraham cohen"
        },
        {
            "review_text": "Bought this product with the understanding I could drop in and use it as a baby monitor, turns out that is not correct. This product only helps you pick out clothes that is all!",
            "review_posted_date": "22 Jul 2018",
            "review_header": "Echo look is for girls that care about fashion.",
            "review_rating": "1.0 ",
            "review_author": "Raymond M Armstrong II"
        },
        {
            "review_text": "So far, this has been useless. Didn't realize when we purchased it that you had to have made a certain amount of purchase on your amazon account to use the device. Forcing you to spend money to .... use a device you spent money on? Attempted to log my girlfriend in on a separate account to use the app and it informed her that her photos couldn't be used because they went against \"community guidelines\". Emailed customer service as to how they violated community guidelines and was told it was because she hadn't spent money on her amazon account. This is perhaps something you should notify customers of before they waste money purchasing the product as a gift for someone else. Attempted to use another account and received 4 error messages in a row. Glitchy, useless, and all information not provided before purchase. Maybe we'll have a better opinion of it if we can actually use it.",
            "review_posted_date": "02 Aug 2018",
            "review_header": "Buyer beware: CANNOT purchase as a gift for someone else",
            "review_rating": "1.0 ",
            "review_author": "Tobias L Merriman"
        },
        {
            "review_text": "The setup failed for iPad Air 2.",
            "review_posted_date": "19 Aug 2018",
            "review_header": "Didn’t work with iPad Air 2",
            "review_rating": "1.0 ",
            "review_author": "Sam"
        },
        {
            "review_text": "mine did not work. When I ook pictures, the whole screen turned a bright green. However, I am hoping it's just a flaw in this particular device.",
            "review_posted_date": "08 Jun 2018",
            "review_header": "mine did not work. When I ook pictures, ...",
            "review_rating": "2.0 ",
            "review_author": "Ariana Briones"
        },
        {
            "review_text": "Seemed like an interesting idea, just limited in what it does. Sure the other Alexa functions work, but didn’t use for a month, so I’m getting rid of it.",
            "review_posted_date": "10 Sep 2018",
            "review_header": "Novelty wore off fast",
            "review_rating": "2.0 ",
            "review_author": "Garrett Kocher"
        },
        {
            "review_text": "I gave this to my daughter for her BD today. It says it is REGISTERED TO SOMEONE ELSE. It will not link up my bluetooth. P҉L҉E҉A҉S҉E҉ fix this mess",
            "review_posted_date": "25 Sep 2018",
            "review_header": "Says it’s registered to a previous owner???",
            "review_rating": "1.0 ",
            "review_author": "Terri hultman"
        },
        {
            "review_text": "Bought as a gift and so far my gf seems to absolutely love it. Also works great as a speaker.",
            "review_posted_date": "16 Aug 2018",
            "review_header": "Love it",
            "review_rating": "5.0 ",
            "review_author": "Edgar Vazquez"
        },
        {
            "review_text": "it just lets them watch you in your everyday life",
            "review_posted_date": "10 Sep 2018",
            "review_header": "this is creepy and lame",
            "review_rating": "1.0 ",
            "review_author": "Andrew"
        },
        {
            "review_text": "Order was cancelled before I received it.",
            "review_posted_date": "09 Aug 2018",
            "review_header": "Don't Know",
            "review_rating": "1.0 ",
            "review_author": "styleepiphanies"
        },
        {
            "review_text": "Nobody would even dream of putting a camera AND a microphone that are designed to syphon up their data where they live, in their home, or would they?",
            "review_posted_date": "03 Jul 2018",
            "review_header": "A Spy-master’s Dream!",
            "review_rating": "1.0 ",
            "review_author": "Hunter"
        },
        {
            "review_text": "I thought I was paying too much for this Look device, at the time. I am not an early adopter but Yes, I pre ordered my Look at $200. After almost a year, I have saved way more than $ 200 in bad decisions and found my style, which saves me shopping time. I can now look at something I would normally be drawn to & think \"Nope, you know this will be in a Goodwill bag in a year\" Just recently found a dress I was In Love with. Checked off all the boxes. Got home, Alexa took a picture. and oh no. The cute little dancing flowers in my mid section turned me from fairy to forest creature. The Look really is priceless. I admit it hurts to see it on Prime Day for half of what I paid but if you truly want to be your best self, You need an honest look. Thanks to the Look, you can now honestly see yourself in pictures, video & comparison outfits, Plus a Digital library of closet when you need inspiration or a shopping reminder to walk away from the floral top. Btw, the Look speaker for music is horrible. Sounds like an old AM radio. Look does give you full interactive Alexa like news, jokes, and of course shopping but limits features like no phone If you want music though, Tap is The choice. It is the only portable device. Even the Dot is wired. As much as I've learned from my Look from fashion choices to spotting a couple extra lbs, my favorite feature is the one that creates memories by taking full length pix of special occasions. I can share the pic to my photo editor, prime photo or text to friends. A selfie is nice but it's not the whole Look.",
            "review_posted_date": "16 Jul 2018",
            "review_header": "Priceless",
            "review_rating": "5.0 ",
            "review_author": "J&J"
        },
        {
            "review_text": "The Echo Look is an interesting device however, it lacks the power of most other Echo devices. It also gets confused when there is another Echo device within hearing distance. The other Echo devices figure out which is the closest to the speaker, however, the Echo Look acts like it cannot. The images and video are great, however, it would be nice to get them automatically outside of the Echo Look mobile app. The Echo Look also has limited skill capabilities and doesn't seem to be up to par with other Echo devices with Alexa capabilities. It is a good second (or third) Echo device, however it is not a good showcase for what Alexa can do.",
            "review_posted_date": "06 Jun 2018",
            "review_header": "Are you talking to me? Are you talking to me?",
            "review_rating": "3.0 ",
            "review_author": "G. Humphrey"
        },
        {
            "review_text": "My husband bought one for me,it works well and funny,but I think the price is too expensive.",
            "review_posted_date": "10 Sep 2018",
            "review_header": "Would be better if cheaper",
            "review_rating": "4.0 ",
            "review_author": "Pacific Chen"
        },
        {
            "review_text": "Worst Echo in the family. No BT/socket to any speakers, limited Alexa functionality with the price higher than Echo Show",
            "review_posted_date": "07 Oct 2018",
            "review_header": "useless",
            "review_rating": "1.0 ",
            "review_author": "sunnyasia"
        },
        {
            "review_text": "I grew up with two sisters and when we dress up we always double check with each other to ensure that we chose the right belt color, the right top to match and even the best matching shoes. I now live alone and in a different time zone. Here comes the Echo Look. I am not saying that it replaced my sisters' opinions but it is doing a banging job trying to be on their level. At time I am unsure about an outfit and the Echo Look has been helpful in coming up with the best/most perfect choice. The Echo Look has the function of all the other Echo device, however it does not sound as good. I would not recommend playing music with it, the music sounds as if it is coming off of one of those old disc (the one before cassette tapes). It does answers to other questions just as the other echo, I just do not personally the sound system in the Echo Look when it comes to answers to those command. Since it was not designed for that purpose, I can say that the bad sound system does not bother me much and will not deduct any stars. It got even better when Amazon fix the commands so that when I ask regular questions, my other echos answer instead of the Echo look. Final Thoughts: I highly recommend this if you're not good at pairing your outfits, if you own too many outfits and need a way to keep track, and/or just for the heck of it. It is not an expensive selfie camera as some have asked, it does a really great job at being a great personal stylist. I highly recommend this product.",
            "review_posted_date": "02 Oct 2018",
            "review_header": "Personal Stylist in your home",
            "review_rating": "5.0 ",
            "review_author": "Rose-Hermance Rony"
        },
        {
            "review_text": "Just to have a daily record of your look makes this worth the price. This helped me see that some of my clothes just did not work.",
            "review_posted_date": "07 Oct 2018",
            "review_header": "Daily documentation.",
            "review_rating": "5.0 ",
            "review_author": "Richard Hamilton"
        }
    ]
}